#!/usr/bin/env python
# -*- coding: utf-8 -*-

#exceptions

stop_words_list = ['ΑΒΑ','ΑΝΑΜΕΣΑ','ΑΥΡΙΟ','ΑΓΑ',
'ΑΝΑΜΕΤΑΞΥ','ΑΦΗΑΓΗ','ΑΝΕΥ','ΑΦΟΤΟΥ',
'ΑΓΩ','ΑΝΤΙ','ΑΦΟΥ','ΑΔΗ','ΑΝΤΙΠΕΡΑ',
'ΑΧ','ΑΔΩ','ΑΝΤΙΣ','ΑΧΕ','ΑΕ','ΑΝΩ',
'ΑΧΟ','ΑΕΙ','ΑΝΩΤΕΡΩ','ΑΨΑ','ΑΘΩ','ΑΞΑΦΝΑ',
'ΑΨΕ','ΑΙ','ΑΠ','ΑΨΗ','ΑΙΚ','ΑΠΕΝΑΝΤΙ',
'ΑΨΥ','ΑΚΗ','ΑΠΟ','ΑΩΕ','ΑΚΟΜΑ','ΑΠΟΨΕ',
'ΑΩΟ','ΑΚΟΜΗ','ΑΠΩ','ΒΑΝ','ΑΚΡΙΒΩΣ',
'ΑΡΑ','ΒΑΤ','ΑΛΑ','ΑΡΑΓΕ','ΒΑΧ','ΑΛΗΘΕΙΑ',
'ΑΡΕ','ΒΕΑ','ΑΛΗΘΙΝΑ','ΑΡΚ','ΒΕΒΑΙΟΤΑΤΑ',
'ΑΛΛΑΧΟΥ','ΑΡΚΕΤΑ','ΒΗΞ','ΑΛΛΙΩΣ','ΑΡΛ',
'ΒΙΑ','ΑΛΛΙΩΤΙΚΑ','ΑΡΜ','ΒΙΕ','ΑΛΛΟΙΩΣ',
'ΑΡΤ','ΒΙΗ','ΑΛΛΟΙΩΤΙΚΑ','ΑΡΥ','ΒΙΟ',
'ΑΛΛΟΤΕ','ΑΡΩ','ΒΟΗ','ΑΛΤ','ΑΣ','ΒΟΩ',
'ΑΛΩ','ΑΣΑ','ΒΡΕ','ΑΜΑ','ΑΣΟ','ΓΑ','ΑΜΕ',
'ΑΤΑ','ΓΑΒ','ΑΜΕΣΑ','ΑΤΕ','ΓΑΡ','ΑΜΕΣΩΣ',
'ΑΤΗ','ΓΕΝ','ΑΜΩ','ΑΤΙ','ΓΕ','ΣΑΝ','ΑΤΜ',
'ΓΗ','ΑΝΑ','ΑΤΟ','ΓΗΝ','ΓΙ','ΔΥΕ','ΕΞ',
'ΓΙΑ','ΔΥΟ','ΕΞΑΦΝΑ','ΓΙΕ','ΔΩ','ΕΞΙ',
'ΓΙΝ','ΕΑΜ','ΕΞΙΣΟΥ','ΓΙΟ','ΕΑΝ','ΕΞΩ',
'ΓΚΙ','ΕΑΡ','ΕΟΚ','ΓΚΥ','ΕΘΗ','ΕΠΑΝΩ',
'ΓΟΗ','ΕΙ','ΕΠΕΙΔΗ','ΓΟΟ','ΕΙΔΕΜΗ','ΕΠΕΙΤΑ',
'ΓΡΗΓΟΡΑ','ΕΙΘΕ','ΕΠΗ',
'ΓΡΙ','ΕΙΜΑΙ','ΕΠΙ','ΓΡΥ','ΕΙΜΑΣΤΕ','ΕΠΙΣΗΣ',
'ΓΥΗ','ΕΙΝΑΙ','ΕΠΟΜΕΝΩΣ','ΓΥΡΩ','ΕΙΣ','ΕΡΑ',
'ΔΑ','ΕΙΣΑΙ','ΕΣ','ΔΕ','ΕΙΣΑΣΤΕ','ΕΣΑΣ',
'ΔΕΗ','ΕΙΣΤΕ','ΕΣΕ','ΔΕΙ','ΕΙΤΕ','ΕΣΕΙΣ',
'ΔΕΝ','ΕΙΧΑ','ΕΣΕΝΑ','ΔΕΣ','ΕΙΧΑΜΕ','ΕΣΗ',
'ΔΗ','ΕΙΧΑΝ','ΕΣΤΩ','ΔΗΘΕΝ','ΕΙΧΑΤΕ','ΕΣΥ',
'ΔΗΛΑΔΗ','ΕΙΧΕ','ΕΣΩ','ΔΗΩ','ΕΙΧΕΣ','ΕΤΙ',
'ΔΙ','ΕΚ','ΕΤΣΙ','ΔΙΑ','ΕΚΟ','ΕΥ',
'ΔΙΑΡΚΩΣ','ΕΚΕΙ','ΕΥΑ','ΔΙΟΛΟΥ','ΕΛΑ','ΕΥΓΕ',
'ΔΙΣ','ΕΛΙ','ΕΥΘΥΣ',
'ΔΙΧΩΣ','ΕΜΠ','ΕΥΤΥΧΩΣ','ΔΟΛ','ΕΝ','ΕΦΕ',
'ΔΟΝ','ΕΝΤΕΛΩΣ','ΕΦΕΞΗΣ',
'ΔΡΑ','ΕΝΤΟΣ','ΕΦΤ','ΔΡΥ','ΕΝΤΩΜΕΤΑΞΥ','ΕΧΕ',
'ΔΡΧ','ΕΝΩ','ΕΧΕΙ','ΕΧΕΙΣ','ΙΒΟ','ΚΑΠΩΣ',
'ΕΧΕΤΕ','ΙΔΗ','ΚΑΤ','ΕΧΘΕΣ','ΙΔΙΩΣ','ΚΑΤΑ',
'ΕΧΟΜΕ','ΙΕ','ΚΑΤΙ','ΕΧΟΥΜΕ','ΙΙ','ΚΑΤΙΤΙ',
'ΕΧΟΥΝ','ΙΙΙ','ΚΑΤΟΠΙΝ','ΕΧΤΕΣ','ΙΚΑ','ΚΑΤΩ',
'ΕΧΩ','ΙΛΟ','ΚΑΩ','ΕΩΣ','ΙΜΑ','ΚΒΟ',
'ΖΕΑ','ΙΝΑ','ΚΕΑ','ΖΕΗ','ΙΝΩ','ΚΕΙ',
'ΖΕΙ','ΙΞΕ','ΚΕΝ','ΖΕΝ','ΙΞΟ','ΚΙ',
'ΖΗΝ','ΙΟ','ΚΙΜ','ΖΩ','ΙΟΙ','ΚΙΟΛΑΣ',
'Η','ΙΣΑ','ΚΙΤ','ΗΔΗ','ΙΣΑΜΕ','ΚΙΧ',
'ΗΔΥ','ΙΣΕ','ΚΚΕ','ΗΘΗ','ΙΣΗ','ΚΛΙΣΕ',
'ΗΛΟ','ΙΣΙΑ','ΚΛΠ','ΗΜΙ','ΙΣΟ','ΚΟΚ',
'ΗΠΑ','ΙΣΩΣ','ΚΟΝΤΑ','ΗΣΑΣΤΕ','ΙΩΒ','ΚΟΧ',
'ΗΣΟΥΝ','ΙΩΝ','ΚΤΛ','ΗΤΑ','ΙΩΣ','ΚΥΡ',
'ΗΤΑΝ','Ιαν','ΚΥΡΙΩΣ','ΗΤΑΝΕ','ΚΑΘ','ΚΩ',
'ΗΤΟΙ','ΚΑΘΕ','ΚΩΝ','ΗΤΤΟΝ','ΚΑΘΕΤΙ','ΛΑ',
'ΗΩ','ΚΑΘΟΛΟΥ','ΛΕΑ','ΘΑ','ΚΑΘΩΣ','ΛΕΝ',
'ΘΥΕ','ΚΑΙ','ΛΕΟ','ΘΩΡ','ΚΑΝ','ΛΙΑ',
'Ι','ΚΑΠΟΤΕ','ΛΙΓΑΚΙ','ΙΑ','ΚΑΠΟΥ','ΛΙΓΟ',
'ΛΙΓΟΤΕΡΟ','ΜΗΝ','ΝΤΑ','ΛΙΟ','ΜΗΠΩΣ','ΝΤΕ',
'ΛΙΡ','ΜΗΤΕ','ΝΤΙ','ΛΟΓΩ','ΜΙ','ΝΤΟ',
'ΛΟΙΠΑ','ΜΙΞ','ΝΥΝ','ΛΟΙΠΟΝ','ΜΙΣ','ΝΩΕ',
'ΛΟΣ','ΜΜΕ','ΝΩΡΙΣ','ΛΣ','ΜΝΑ','ΞΑΝΑ',
'ΛΥΩ','ΜΟΒ','ΞΑΦΝΙΚΑ','ΜΑ','ΜΟΛΙΣ','ΞΕΩ',
'ΜΑΖΙ','ΜΟΛΟΝΟΤΙ','ΞΙ','ΜΑΚΑΡΙ','ΜΟΝΑΧΑ','Ο',
'ΜΑΛΙΣΤΑ','ΜΟΝΟΜΙΑΣ','ΟΑ','ΜΑΛΛΟΝ','ΜΟΥ','ΟΑΠ',
'ΜΑΝ','ΜΠΑ','ΟΔΟ','ΜΑΞ','ΜΠΟΡΕΙ','ΟΕ',
'ΜΑΣ','ΜΠΟΡΟΥΝ','ΟΖΟ','ΜΑΤ','ΜΠΡΑΒΟ','ΟΗΕ',
'ΜΕ','ΜΠΡΟΣ','ΟΙ','ΜΕΘΑΥΡΙΟ','ΜΠΩ','ΟΙΑ',
'ΜΕΙ','ΜΥ','ΟΙΗ','ΜΕΙΟΝ','ΜΥΑ','ΟΚΑ',
'ΜΕΛ','ΜΥΝ','ΟΛΟΓΥΡΑ','ΜΕΛΕΙ','ΝΑ','ΟΛΟΝΕΝ',
'ΜΕΛΛΕΤΑΙ','ΝΑΕ','ΟΛΟΤΕΛΑ','ΜΕΜΙΑΣ','ΝΑΙ','ΟΛΩΣΔΙΟΛΟΥ',
'ΜΕΝ','ΝΑΟ','ΟΜΩΣ','ΜΕΣ','ΝΔ','ΟΝ',
'ΜΕΣΑ','ΝΕΐ','ΟΝΕ','ΜΕΤ','ΝΙ','ΟΝΟ',
'ΜΕΤΑ','ΝΙΑ','ΟΠΑ','ΜΕΤΑΞΥ','ΝΙΚ','ΟΠΕ',
'ΜΕΧΡΙ','ΝΙΛ','ΟΠΗ','ΜΗ','ΝΙΝ','ΟΠΟ','ΜΗΔΕ','ΝΙΟ','ΟΠΟΙΑΔΗΠΟΤΕ',
'ΟΠΟΙΑΝΔΗΠΟΤΕ','ΟΤΕ','ΠΙΚ','ΟΠΟΙΑΣΔΗΠΟΤΕ','ΟΤΙ','ΠΙΟ',
'ΟΠΟΙΔΗΠΟΤΕ','ΟΤΙΔΗΠΟΤΕ','ΠΙΣΩ','ΟΠΟΙΕΣΔΗΠΟΤΕ','ΟΥ','ΠΙΤ',
'ΟΠΟΙΟΔΗΠΟΤΕ','ΟΥΔΕ','ΠΙΩ','ΟΠΟΙΟΝΔΗΠΟΤΕ','ΟΥΚ','ΠΛΑΙ',
'ΟΠΟΙΟΣΔΗΠΟΤΕ','ΟΥΣ','ΠΛΕΟΝ','ΟΠΟΙΟΥΔΗΠΟΤΕ','ΟΥΤΕ','ΠΛΗΝ',
'ΟΠΟΙΟΥΣΔΗΠΟΤΕ','ΟΥΦ','ΠΛΩ','ΟΠΟΙΩΝΔΗΠΟΤΕ','ΟΧΙ','ΠΜ',
'ΟΠΟΤΕΔΗΠΟΤΕ','ΟΨΑ','ΠΟΑ','ΟΠΟΥ','ΟΨΕ','ΠΟΕ',
'ΟΠΟΥΔΗΠΟΤΕ','ΟΨΗ','ΠΟΛ','ΟΠΩΣ','ΟΨΙ','ΠΟΛΥ',
'ΟΡΑ','ΟΨΟ','ΠΟΠ','ΟΡΕ','ΠΑ','ΠΟΤΕ',
'ΟΡΗ','ΠΑΛΙ','ΠΟΥ','ΟΡΟ','ΠΑΝ','ΠΟΥΘΕ',
'ΟΡΦ','ΠΑΝΤΟΤΕ','ΠΟΥΘΕΝΑ','ΟΡΩ','ΠΑΝΤΟΥ','ΠΡΕΠΕΙ',
'ΟΣΑ','ΠΑΝΤΩΣ','ΠΡΙ','ΟΣΑΔΗΠΟΤΕ','ΠΑΠ','ΠΡΙΝ',
'ΟΣΕ','ΠΑΡ','ΠΡΟ','ΟΣΕΣΔΗΠΟΤΕ','ΠΑΡΑ','ΠΡΟΚΕΙΜΕΝΟΥ',
'ΟΣΗΔΗΠΟΤΕ','ΠΕΙ','ΠΡΟΚΕΙΤΑΙ','ΟΣΗΝΔΗΠΟΤΕ','ΠΕΡ','ΠΡΟΠΕΡΣΙ',
'ΟΣΗΣΔΗΠΟΤΕ','ΠΕΡΑ','ΠΡΟΣ','ΟΣΟΔΗΠΟΤΕ','ΠΕΡΙ','ΠΡΟΤΟΥ',
'ΟΣΟΙΔΗΠΟΤΕ','ΠΕΡΙΠΟΥ','ΠΡΟΧΘΕΣ','ΟΣΟΝΔΗΠΟΤΕ','ΠΕΡΣΙ','ΠΡΟΧΤΕΣ',
'ΟΣΟΣΔΗΠΟΤΕ','ΠΕΡΥΣΙ','ΠΡΩΤΥΤΕΡΑ','ΟΣΟΥΔΗΠΟΤΕ','ΠΕΣ','ΠΥΑ',
'ΟΣΟΥΣΔΗΠΟΤΕ','ΠΙ','ΠΥΞ','ΟΣΩΝΔΗΠΟΤΕ','ΠΙΑ','ΠΥΟ',
'ΟΤΑΝ','ΠΙΘΑΝΟΝ','ΠΥΡ','ΠΧ','ΣΕΡ','ΤΑ',
'ΠΩ','ΣΕΤ','ΤΑΔΕ','ΠΩΛ','ΣΕΦ','ΤΑΚ',
'ΠΩΣ','ΣΗΜΕΡΑ','ΤΑΝ','ΡΑ','ΣΙ','ΤΑΟ',
'ΡΑΙ','ΣΙΑ','ΤΑΥ','ΡΑΠ','ΣΙΓΑ','ΤΑΧΑ',
'ΡΑΣ','ΣΙΚ','ΤΑΧΑΤΕ','ΡΕ','ΣΙΧ','ΤΕ',
'ΡΕΑ','ΣΚΙ','ΤΕΙ','ΡΕΕ','ΣΟΙ','ΤΕΛ',
'ΡΕΙ','ΣΟΚ','ΤΕΛΙΚΑ','ΡΗΣ','ΣΟΛ','ΤΕΛΙΚΩΣ',
'ΡΘΩ','ΣΟΝ','ΤΕΣ','ΡΙΟ','ΣΟΣ','ΤΕΤ',
'ΡΟ','ΣΟΥ','ΤΖΟ','ΡΟΐ','ΣΡΙ','ΤΗ',
'ΡΟΕ','ΣΤΑ','ΤΗΛ','ΡΟΖ','ΣΤΗ','ΤΗΝ',
'ΡΟΗ','ΣΤΗΝ','ΤΗΣ','ΡΟΘ','ΣΤΗΣ','ΤΙ',
'ΡΟΙ','ΣΤΙΣ','ΤΙΚ','ΡΟΚ','ΣΤΟ','ΤΙΜ',
'ΡΟΛ','ΣΤΟΝ','ΤΙΠΟΤΑ','ΡΟΝ','ΣΤΟΥ','ΤΙΠΟΤΕ',
'ΡΟΣ','ΣΤΟΥΣ','ΤΙΣ','ΡΟΥ','ΣΤΩΝ','ΤΝΤ',
'ΣΑΙ','ΣΥ','ΤΟ','ΣΑΝ','ΣΥΓΧΡΟΝΩΣ','ΤΟΙ',
'ΣΑΟ','ΣΥΝ','ΤΟΚ','ΣΑΣ','ΣΥΝΑΜΑ','ΤΟΜ',
'ΣΕ','ΣΥΝΕΠΩΣ','ΤΟΝ','ΣΕΙΣ','ΣΥΝΗΘΩΣ','ΤΟΠ',
'ΣΕΚ','ΣΧΕΔΟΝ','ΤΟΣ','ΣΕΞ','ΣΩΣΤΑ','ΤΟΣΩΝ',
'ΤΟΣΑ','ΥΠΟΨΙΝ','ΧΟΗ','ΤΟΣΕΣ','ΥΣΤΕΡΑ','ΧΟΛ',
'ΤΟΣΗ','ΥΦΗ','ΧΡΩ','ΤΟΣΗΝ','ΥΨΗ','ΧΤΕΣ',
'ΤΟΣΗΣ','ΦΑ','ΧΩΡΙΣ','ΤΟΣΟ','ΦΑΐ','ΧΩΡΙΣΤΑ',
'ΤΟΣΟΙ','ΦΑΕ','ΨΕΣ','ΤΟΣΟΝ','ΦΑΝ','ΨΗΛΑ',
'ΤΟΣΟΣ','ΦΑΞ','ΨΙ','ΤΟΣΟΥ','ΦΑΣ','ΨΙΤ',
'ΤΟΣΟΥΣ','ΦΑΩ','Ω','ΤΟΤΕ','ΦΕΖ','ΩΑ',
'ΤΟΥ','ΦΕΙ','ΩΑΣ','ΤΟΥΛΑΧΙΣΤΟ','ΦΕΤΟΣ','ΩΔΕ',
'ΤΟΥΛΑΧΙΣΤΟΝ','ΦΕΥ','ΩΕΣ','ΤΟΥΣ','ΦΙ','ΩΘΩ',
'ΤΣ','ΦΙΛ','ΩΜΑ','ΤΣΑ','ΦΙΣ','ΩΜΕ',
'ΤΣΕ','ΦΟΞ','ΩΝ','ΤΥΧΟΝ','ΦΠΑ','ΩΟ',
'ΤΩ','ΦΡΙ','ΩΟΝ','ΤΩΝ','ΧΑ','ΩΟΥ',
'ΤΩΡΑ','ΧΑΗ','ΩΣ','ΥΑΣ','ΧΑΛ','ΩΣΑΝ',
'ΥΒΑ','ΧΑΝ','ΩΣΗ','ΥΒΟ','ΧΑΦ','ΩΣΟΤΟΥ',
'ΥΙΕ','ΧΕ','ΩΣΠΟΥ','ΥΙΟ','ΧΕΙ','ΩΣΤΕ',
'ΥΛΑ','ΧΘΕΣ','ΩΣΤΟΣΟ','ΥΛΗ','ΧΙ','ΩΤΑ',
'ΥΝΙ','ΧΙΑ','ΩΧ','ΥΠ','ΧΙΛ','ΩΩΝ',
'ΥΠΕΡ','ΧΙΟ','ΓΙΑΤΙ','ΥΠΟ','ΧΛΜ','ΥΠΟΨΗ','ΧΜ']


def exceptions(word):
	root = None
	if word in ['ΦΑΓΙΑ','ΦΑΓΙΟΥ','ΦΑΓΙΩΝ']:
		root = 'ΦΑ'
	elif word in ['ΣΚΑΓΙΑ','ΣΚΑΓΙΟΥ','ΣΚΑΓΙΩΝ']:
		root = 'ΣΚΑ'
	elif word in ['ΟΛΟΓΙΟΥ','ΟΛΟΓΙΑ','ΟΛΟΓΙΩΝ']:
		root= 'ΟΛΟ'
	elif word in ['ΣΟΓΙΟΥ','ΣΟΓΙΑ','ΣΟΓΙΩΝ']:
		root= 'ΣΟ'
	elif word in ['ΤΑΤΟΓΙΑ','ΤΑΤΟΓΙΟΥ','ΤΑΤΟΓΙΩΝ']:
		root = 'ΤΑΤΟ'
	elif word in ['ΚΡΕΑΣ','ΚΡΕΑΤΟΣ','ΚΡΕΑΤΑ','ΚΡΕΑΤΩΝ']:
		root = 'ΚΡΕ'
	elif word in ['ΠΕΡΑΣ','ΠΕΡΑΤΟΣ','ΠΕΡΑΤΗ','ΠΕΡΑΤΑ','ΠΕΡΑΤΩΝ']:
		root = 'ΠΕΡ'
	elif word in ['ΤΕΡΑΣ','ΤΕΡΑΤΟΣ','ΤΕΡΑΤΑ','ΤΕΡΑΤΩΝ']:
		root = 'ΤΕΡ'
	elif word in ['ΦΩΣ','ΦΩΤΟΣ','ΦΩΤΑ','ΦΩΤΩΝ']:
		root = 'ΦΩ'
	elif word in ['ΚΑΘΕΣΤΩΣ','ΚΑΘΕΣΤΩΤΟΣ','ΚΑΘΕΣΤΩΤΑ','ΚΑΘΕΣΤΩΤΩΝ']:
		root = 'ΚΑΘΕΣΤ'
	elif word in ['ΓΕΓΟΝΟΣ','ΓΕΓΟΝΟΤΟΣ','ΓΕΓΟΝΟΤΑ','ΓΕΓΟΝΟΤΩΝ']:
		root = 'ΓΕΓΟΝ'
	return root

